OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle0.0/0.org/include/initialConditions
flowVelocity          (2.572222 0 0);
Umean                  2.572222;
turbulentKE            9.924489e-04;
turbulentOmega         4.287037e-01;
turbulentEpsilon       2.591986e-02;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;