OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle0.0/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


forces
{
	type forces;
	libs ( "libforces.so" );
	rho rhoInf;
	log yes;
	writeControl timeStep;
	writeInterval 1;
	patches ( hull bow skeg skegEdge stern deck );
	rhoInf 999.1;
	CofR (0.0 0.0 0.0);
}

forceCoeffs
{
	type forceCoeffs;
	libs ( "libforces.so" );
	log yes;
	writeControl timeStep;
	writeInterval 1;
	rho rhoInf;
	patches ( hull bow skeg skegEdge stern deck );
	rhoInf 999.1;
	CofR (0.0 0.0 0.0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	pitchAxis (0 0 1);
	magUInf 2.572222;
	lRef 30.0;
	Aref 45.0;
}