OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle0.0/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     snappyHexMeshDict;
}


	castellatedMesh    true;
	snap               true;
	addLayers          true;

geometry
{
	kelvinWake1.obj
	{
		type triSurfaceMesh;
		name kelvinWake1;
	}

	kelvinWake2.obj
	{
		type triSurfaceMesh;
		name kelvinWake2;
	}

	ship
	{
		type triSurfaceMesh;
		file "ship.obj";

		regions
		{
			ship_ship_hull
			{
				name hull;
			}
			ship_ship_bow
			{
				name bow;
			}
			ship_ship_skeg
			{
				name skeg;
			}
			ship_ship_skegEdge
			{
				name skegEdge;
			}
			ship_ship_stern
			{
				name stern;
			}
			ship_ship_deck
			{
				name deck;
			}
		}
	}

	viscBox3
	{
		type searchableBox;
		min (12.680154 -4.273338 -2.190600);
		max (20.180154 1.607862 0.750000);
	}

	viscBox2
	{
		type searchableBox;
		min (12.680154 -5.365552 -3.282814);
		max (23.930154 2.700076 0.750000);
	}

	viscBox1
	{
		type searchableBox;
		min (12.680154 -7.185909 -5.103171);
		max (29.555154 4.520433 0.750000);
	}

}

castellatedMeshControls
{
	maxLocalCells 5000000;
	maxGlobalCells 2000000000;
	minRefinementCells 10;
	maxLoadUnbalance 0.1;
	nCellsBetweenLevels 5;
	resolveFeatureAngle 60;
	locationInMesh (-30.000 6.750 -3.000);
	allowFreeStandingZoneFaces true;

	features
	(
		{
			file "ship.eMesh";
			level 4;
		}
	);

	refinementSurfaces
	{
		ship
		{
			level (3 3);
			regions
			{
				ship_ship_hull
				{
					level (5 5);
				}
				ship_ship_bow
				{
					level (6 6);
				}
				ship_ship_skeg
				{
					level (6 6);
				}
				ship_ship_skegEdge
				{
					level (7 7);
				}
				ship_ship_stern
				{
					level (6 6);
				}
				ship_ship_deck
				{
					level (3 3);
				}
			}
		}

	}

	refinementRegions
	{
		kelvinWake1
		{
			mode inside;
			levels ((1.0 1));
		}

		kelvinWake2
		{
			mode inside;
			levels ((1.0 2));
		}

		viscBox3
		{
			mode inside;
			levels ((2.940600 3));
		}

		viscBox2
		{
			mode inside;
			levels ((4.032814 2));
		}

		viscBox1
		{
			mode inside;
			levels ((5.853171 1));
		}

		ship
		{
			mode distance;
			levels ((1.500000 3));
		}

	}
}

snapControls
{
	nSmoothPatch              10;
	nSmoothInternal           10;
	tolerance                 5.0;
	nSolveIter                300;
	nRelaxIter                10;
	nFeatureSnapIter          10;
	detectNearSurfaceSnap     true;
	implicitFeatureSnap       true;
	explicitFeatureSnap       true;
	multiRegionFeatureSnap    true;
}

addLayersControls
{
	meshShrinker displacementMotionSolver;
	solver       displacementLaplacian;
	displacementLaplacianCoeffs
	{
		diffusivity    quadratic inverseDistance 1(wall);
	}

	layers
	{
		hull
		{
			nSurfaceLayers 10;
		}
		bow
		{
			nSurfaceLayers 0;
		}
		skeg
		{
			nSurfaceLayers 8;
		}
		skegEdge
		{
			nSurfaceLayers 0;
		}
		stern
		{
			nSurfaceLayers 0;
		}
		deck
		{
			nSurfaceLayers 0;
		}
	}

	relativeSizes true;
	finalLayerThickness 0.5;
	expansionRatio 1.3;
	minThickness 0.05;
	nGrow 0;
	featureAngle 60;
	slipFeatureAngle 30;
	layerTerminationAngle 30;
	nRelaxIter 5;
	nSmoothSurfaceNormals 3;
	nSmoothNormals 3;
	nSmoothThickness 10;
	maxFaceThicknessRatio 0.5;
	maxThicknessToMedialRatio 0.3;
	minMedianAxisAngle 90;
	nBufferCellsNoExtrude 0;
	nLayerIter 50;
	nRelaxedIter 20;
}

meshQualityControls
{
	maxNonOrtho            65;
	maxBoundarySkewness    20;
	maxInternalSkewness    4;
	maxConcave             80;
	minVol                 -1e+30;
	minTetQuality          -1e+30;
	minArea                -1;
	minTwist               0.05;
	minDeterminant         0.001;
	minFaceWeight          0.05;
	minVolRatio            0.01;
	minTriangleTwist       -1;
	nSmoothScale           4;
	errorReduction         0.75;
	relaxed
	{
		maxNonOrtho    75;
	}
}

mergeTolerance 1e-06;
